package com.eex.market.bean;

import java.math.BigDecimal;
import java.util.List;

/**
 * _ooOoo_
 * o8888888o
 * 88" . "88
 * (| -_- |)
 * O\ = /O
 * ____/`---'\____
 * . ' \\| |// `.
 * / \\||| : |||// \
 * / _||||| -:- |||||- \
 * | | \\\ - /// | |
 * | \_| ''\---/'' | |
 * \ .-\__ `-` ___/-. /
 * ___`. .' /--.--\ `. . __
 * ."" '< `.___\_<|>_/___.' >'"".
 * | | : `- \`.;`\ _ /`;.`/ - ` : | |
 * \ \ `-. \_ __\ /__ _/ .-` / /
 * ======`-.____`-.___\_____/___.-`____.-'======
 * `=---='
 * <p>
 * .............................................
 * 佛祖保佑 永无BUG
 *
 * @ProjectName: overthrow
 * @Package: com.overthrow.market.bean
 * @ClassName: CoinCashFlowBean
 * @Description: java类作用描述
 * @Author: 胡成军
 * @CreateDate: 2019/11/4 11:20
 * @UpdateUser: 更新者
 * @UpdateDate: 2019/11/4 11:20
 * @UpdateRemark: 更新说明
 * @Version: 1.0
 */
public class CoinCashFlowBean<T> {

    /**
     * chart : [[1572750900,0],[1572751800,0],[1572752700,0],[1572753600,0],[1572754500,0],[1572755400,0],[1572756300,0],[1572757200,0],[1572758100,0],[1572759000,0],[1572759900,0],[1572760800,0],[1572761700,0],[1572762600,0],[1572763500,0],[1572764400,0],[1572765300,0],[1572766200,0],[1572767100,0],[1572768000,0],[1572768900,0],[1572769800,0],[1572770700,0],[1572771600,0],[1572772500,0],[1572773400,0],[1572774300,0],[1572775200,0],[1572776100,0],[1572777000,0],[1572777900,0],[1572778800,0],[1572779700,0],[1572780600,0],[1572781500,0],[1572782400,0],[1572783300,0],[1572784200,0],[1572785100,0],[1572786000,0],[1572786900,0],[1572787800,0],[1572788700,0],[1572789600,0],[1572790500,0],[1572791400,0],[1572792300,0],[1572793200,0],[1572794100,0],[1572795000,0],[1572795900,0],[1572796800,0],[1572797700,0],[1572798600,0],[1572799500,0],[1572800400,0],[1572801300,0],[1572802200,0],[1572803100,0],[1572804000,0],[1572804900,0],[1572805800,0],[1572806700,0],[1572807600,0],[1572808500,0],[1572809400,0],[1572810300,0],[1572811200,0],[1572812100,0],[1572813000,0],[1572813900,0],[1572814800,0],[1572815700,0],[1572816600,0],[1572817500,0],[1572818400,0],[1572819300,0],[1572820200,0],[1572821100,0],[1572822000,0],[1572822900,0],[1572823800,0],[1572824700,0],[1572825600,0],[1572826500,0],[1572827400,0],[1572828300,0],[1572829200,0],[1572830100,0],[1572831000,0],[1572831900,0],[1572832800,0],[1572833700,0],[1572834600,0],[1572835500,0],[1572836400,0]]
     * history : [{"id":0,"coin_id":"","buy_vol":175.411880454,"sell_vol":174.29630458449998,"buy_vol_usd":1098.022,"sell_vol_usd":3170.9034,"close":0,"volume_usd":0,"data":"","timestamp":1572837395},{"id":513,"coin_id":"","buy_vol":557.1030657059999,"sell_vol":2295.437645090101,"buy_vol_usd":3371.248199999999,"sell_vol_usd":9559.0017,"close":0.0031923,"volume_usd":232850.144004898,"data":"{\"buy_vol\":557.1030657059999,\"sell_vol\":2295.437645090101,\"last_trade_time\":1572738373,\"buy_vol_usd\":3371.248199999999,\"sell_vol_usd\":9559.0017,\"buy_vol_usd_set\":{\"s\":3371.248199999999},\"sell_vol_usd_set\":{\"s\":9559.0017},\"buy_count_set\":{\"s\":66},\"sell_cou","timestamp":1572652800},{"id":512,"coin_id":"","buy_vol":14048.642598705947,"sell_vol":19280.98819828308,"buy_vol_usd":70742.7598,"sell_vol_usd":94293.08250000002,"close":0.00326116,"volume_usd":445133.2668056741,"data":"{\"buy_vol\":14048.642598705947,\"sell_vol\":19280.98819828308,\"last_trade_time\":1572652729,\"buy_vol_usd\":70742.7598,\"sell_vol_usd\":94293.08250000002,\"buy_vol_usd_set\":{\"s\":50373.55860000001,\"m\":20369.2012},\"sell_vol_usd_set\":{\"m\":19176.7508,\"s\":75116.3317000","timestamp":1572566400},{"id":511,"coin_id":"","buy_vol":5558.887938111315,"sell_vol":4201.7986304403075,"buy_vol_usd":18543.3748,"sell_vol_usd":16208.300900000002,"close":0.00329512,"volume_usd":844222.4303857839,"data":"{\"buy_vol\":5558.887938111315,\"sell_vol\":4201.7986304403075,\"last_trade_time\":1572565939,\"buy_vol_usd\":18543.3748,\"sell_vol_usd\":16208.300900000002,\"buy_vol_usd_set\":{\"s\":11166.728099999997,\"m\":7376.6467},\"sell_vol_usd_set\":{\"s\":16208.300900000002},\"buy_co","timestamp":1572480000},{"id":510,"coin_id":"","buy_vol":1247.0787419653138,"sell_vol":1707.2360512348112,"buy_vol_usd":5610.856000000001,"sell_vol_usd":8055.069999999998,"close":0.00315353,"volume_usd":257960.56491634916,"data":"{\"buy_vol\":1247.0787419653138,\"sell_vol\":1707.2360512348112,\"last_trade_time\":1572479324,\"buy_vol_usd\":5610.856000000001,\"sell_vol_usd\":8055.069999999998,\"buy_vol_usd_set\":{\"s\":5610.856000000001},\"sell_vol_usd_set\":{\"s\":8055.069999999998},\"buy_count_set\":","timestamp":1572393600}]
     * today : {"buy_vol":175.411880454,"sell_vol":174.29630458449998,"last_trade_time":1572836964,"buy_vol_usd":1098.022,"sell_vol_usd":3170.9034,"buy_vol_usd_set":{"s":1098.022},"sell_vol_usd_set":{"s":3170.9034}}
     * rate : 7.037404
     */


    private String rate;

    private List<T> history;
    public TodayBean today;

    public String getRate() {
        return rate;
    }

    public void setRate(String rate) {
        this.rate = rate;
    }


    public List<T> getHistory() {
        return history;
    }

    public void setHistory(List<T> history) {
        this.history = history;
    }

    public static class TodayBean{
        public BigDecimal buy_vol;
        public BigDecimal sell_vol;
        public Long last_trade_time;
        public BigDecimal buy_vol_usd;
        public BigDecimal sell_vol_usd;
        public UsdSet buy_vol_usd_set;
        public UsdSet sell_vol_usd_set;
    }

    public static class UsdSet{
        public BigDecimal s;
        public BigDecimal b;
        public BigDecimal m;
    }

    @Override
    public String toString() {
        return "CoinCashFlowBean{" +
                ", rate='" + rate + '\'' +
                ", history=" + history +
                '}';
    }
}
